<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"3598ee2410cd2f22ebe753fe68a6db3d913f57673f49811a1f917d3bd1893ac4","plan_job_ref":"Job Docker Image Build & Push (Staging Environment) #44 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7307418755","plan_hash":"a49e1026f5bd4675f3023163cc72eefe4bd2d9f1ce633a32dbb18e57f89e87f2","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecrpublic_repository.fastapi-ecr-public will be created
  + resource "aws_ecrpublic_repository" "fastapi-ecr-public" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "irezd/fastapi"
      + repository_uri  = (known after apply)
      + tags_all        = (known after apply)

      + catalog_data {
          + about_text      = "A FastAPI docker image"
          + description     = "This is a containerized images of FastAPI stored on ECR Staging environment"
          + logo_image_blob = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Docker Image Build & Push (Staging Environment) #44](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7307418755)